tutorials/combustion/fireFoam/les/smallPoolFire3D/constant/pyrolysisProperties
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      pyrolysisProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

active          false;

pyrolysisModel  none;

regionName      panelRegion;

reactingOneDimCoeffs
{
    filmCoupled     false;

    radFluxName     Qr;

    minimumDelta    1e-8;

    moveMesh        false;
}

infoOutput      false;

// ************************************************************************* //
